app/controllers/admin_controller.rb

  def index
    @location_count = Location.count
    @live_locations = Location.visible.count

    @comment_count = Comment.count
    @spam_comments = Comment.hidden.count

    @locations = Location.find_all_by_is_visible(false, :order => 'created_at DESC')
    @news = Story.limit(5)
    @comments = Comment.limit(5).order('created_at desc')
---
SELECT COUNT(*) FROM `locations`
SELECT COUNT(*) FROM `comments`
SELECT `locations`.* FROM `locations` WHERE `locations`.`is_visible` = 0 ORDER BY name, created_at DESC
SELECT `stories`.* FROM `stories` ORDER BY created_at DESC LIMIT 5
SELECT `comments`.* FROM `comments` ORDER BY created_at desc LIMIT 5