app/controllers/admin_controller.rb

  def index
    @location_count = Location.count
    @live_locations = Location.count "visibility = 'yes'"

    @comment_count = Comment.count
    @spam_comments = Comment.count 'hide = 1'
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`hide` = 1