app/controllers/submissions_controller.rb

SELECT zip FROM `locations` WHERE (zip IS NOT NULL AND is_visible = 1) GROUP BY zip ORDER BY name, zip
INSERT INTO `locations` (`free`, `ssid`, `is_visible`, `comments_count`, `phone_number`, `email`, `status`, `street`, `name`, `permalink`, `url`, `state`, `description`, `created_at`, `country`, `city`, `updated_at`, `delta`, `zip`) VALUES (NULL, '', 0, 0, '', '', 'proven', '65 Auburn Ave NE', 'My House', NULL, '', NULL, '', '2010-12-22 21:02:30', NULL, '', '2010-12-22 21:02:30', 1, '49503')
UPDATE `locations` SET `free` = NULL, `ssid` = '', `phone_number` = '', `is_visible` = 0, `comments_count` = 0, `street` = '65 Auburn Ave NE', `status` = 'proven', `email` = '', `permalink` = 'my-house--2', `name` = 'My House', `url` = '', `state` = NULL, `description` = '', `created_at` = '2010-12-22 21:02:30', `country` = 'US', `city` = 'Grand Rapids', `zip` = '49503', `updated_at` = '2010-12-22 21:02:30', `delta` = 1 WHERE (`locations`.`id` = 161)
---
  def create
    @submitter = Submitter.new(params[:submitter])
    @location = Location.new(params[:location])
    @comparisons = Location.find_similar(@location.name)

    if @submitter.valid? and @location.valid? and (@comparisons.empty? or params[:is_sure] == '1')
      @location.save